<ul>
    <li>Сделай панель администрирования интернет магазина, я хочу чтобы были Категории (категории чтобы могли быть вложенными), Товары, Склад, Наличие, Поставщики, Заказы.</li>
    <li>У товаров должно быть поле изображений (галерея).</li>
    <li>Так же у Товаров может быть сразу несколько категорий.</li>
    <li>У заказов должен быть ресурс статусов, чтобы можно было самому добавлять статусы, а так же у заказов должны быть комментарии.</li>
    <li>У склада имя и адрес.</li>
    <li>Наличие содержит склад, поставщика, товар и количество.</li>
    <li>У поставщика должно быть имя, и поле документы с типом файлы.</li>
    <li>У товаров поле описание должно быть в текстовом редакторе TinyMce.</li>
</ul>
